//******************************************************************************
//******************************************************************************
//**                                                                          **
//** Copyright(C) 2020-2021, XCradle Electronic Information Industry Co., Ltd. **
//**                                                                          **
//**                          All Rights Reserved.                            **
//**                                                                          **
//******************************************************************************
//******************************************************************************

//******************************************************************************
// [File] XCradleChsBmcUserSettings.uni
// [Description] Add XCradle Chinese STR define in this file
// [Author] JSY-ZZP
// [Date] 2021/02/25
//******************************************************************************
/=#
#langdef   x-AMI "x-AMI"
#langdef   en-US "English"
#langdef   zh-chs "中文 (简体)"

#string STR_BMC_USER_SETTINGS_TITLE                 #language zh-chs "BMC用户设置"
#string STR_BMC_USER_SETTINGS_HELP                  #language zh-chs "按回车键进入菜单进行增加,删除和设定用户权限范围等操作。"
#string STR_ADD_BMC_USER                            #language zh-chs "增加用户"
#string STR_ADD_BMC_USER_HELP                       #language zh-chs "按回车键进入菜单进行增加用户操作。"
#string STR_DELETE_BMC_USER                         #language zh-chs "删除用户"
#string STR_DELETE_BMC_USER_HELP                    #language zh-chs "按回车键进入菜单进行删除用户操作。"
#string STR_CHANGE_BMC_USER_SETTINGS                #language zh-chs "修改用户设置"
#string STR_CHANGE_BMC_USER_SETTINGS_HELP           #language zh-chs "按回车键进入菜单进行改变用户设置。"
#string STR_BMC_ADD_USER_TITLE                      #language zh-chs "BMC增加用户详情"
#string STR_BMC_USER_NAME_ADD                       #language zh-chs "用户名称"
#string STR_BMC_USER_PASSWORD_ADD                   #language zh-chs "用户密码"
#string STR_ADD_BMC_USER_ACCESS                     #language zh-chs "用户访问权限"
#string STR_ADD_BMC_CHANNEL_NUMBER                  #language zh-chs "通道号"
#string STR_ADD_BMC_USER_PRIVILEGE_LIMIT            #language zh-chs "用户权限限制"
#string STR_BMC_DELETE_USER_TITLE                   #language zh-chs "BMC删除用户详情"
#string STR_BMC_USER_NAME_DELETE                    #language zh-chs "用户名称"
#string STR_BMC_USER_PASSWORD_DELETE                #language zh-chs "用户密码"
#string STR_BMC_CHANGE_USER_SETTINGS_TITLE          #language zh-chs "BMC修改用户设置"
#string STR_BMC_USER_NAME_CHANGE                    #language zh-chs "用户名称"
#string STR_BMC_USER_PASSWORD_CHANGE                #language zh-chs "用户密码"
#string STR_BMC_CHANGE_USER_PASSWORD                #language zh-chs "修改用户密码"
#string STR_CHANGE_BMC_USER_ACCESS                  #language zh-chs "用户访问权限"
#string STR_CHANGE_BMC_CHANNEL_NUMBER               #language zh-chs "通道号"
#string STR_CHANGE_BMC_USER_PRIVILEGE_LIMIT         #language zh-chs "用户权限限制"
#string STR_BMC_USER_NAME_HELP                      #language zh-chs "输入BMC用户名称, 用户名由1至16个字母或数字组成, 且必须由字母开头, 区分大小写, 特殊字符仅允许 '-'(连接符), '_'(下划线), '@'(at符号)"
#string STR_BMC_USER_PASSWORD_HELP                  #language zh-chs "输入BMC用户密码, 需包括特殊字符、大写字母、小写字母、数字。当启用BMC密码复杂度时，密码最小长度由BMC指定"
#string STR_BMC_CHANNEL_NUMBER_HELP                 #language zh-chs "输入BMC通道号。共享网口是8，专用网口是1。"
#string STR_BMC_USER_PRIVILEGE_LIMIT_HELP           #language zh-chs "为选定的通道设置BMC用户权限"
#string STR_BMC_CHANGE_USER_PASSWORD_HELP           #language zh-chs "输入修改的新密码"
#string STR_BMC_USER_ACCESS_HELP                    #language zh-chs "启用或禁用该用户访问权限"
#string STR_RESERVED                                #language zh-chs "预留"
#string STR_CALLBACK                                #language zh-chs "回调"
#string STR_USER                                    #language zh-chs "用户"
#string STR_OPERATOR                                #language zh-chs "操作"
#string STR_ADMINISTRATOR                           #language zh-chs "管理员"
#string STR_OEM_PROPRIETARY                         #language zh-chs "OEM专属"
#string STR_NO_ACCESS                               #language zh-chs "没有权限"
#string STR_USER_ENABLE                             #language zh-chs "启用"
#string STR_USER_DISABLE                            #language zh-chs "禁用"
#string STR_BMC_USER_SETTINGS_INFO                  #language zh-chs "BMC用户设置信息"
#string STR_IPMI_PROTOCOL_ERROR                     #language zh-chs "IPMI协议错误！"
#string STR_NEW_USER_ADD_ERROR                      #language zh-chs "添加新用户不存在！"
#string STR_USER_NAME_EXISTS                        #language zh-chs "用户名已存在，设置新用户名！"
#string STR_USER_ADD_NOT_POSSIBLE                   #language zh-chs "已达到最大用户！"
#string STR_SET_USER_NAME_CMD_FAIL                  #language zh-chs "设置用户名命令失败！"
//XCradle-ZJ20220614V001-Mod-Start
//#string STR_SET_USER_PASSWORD_FAIL                  #language zh-chs "设置用户密码失败！"
#string STR_SET_USER_PASSWORD_FAIL                  #language zh-chs   "无效密码,可能是密码格式不对或BMC密码复杂度检测到输入的是历史密码（详细信息请参考BMC用户精细化管理界面）"
//XCradle-ZJ20220614V001-Mod-End
#string STR_GET_CHANNEL_ACCESS_CMD_FAIL             #language zh-chs "获取通道访问命令失败！"
#string STR_SET_USER_ACCESS_CMD_FAIL                #language zh-chs "设置用户访问命令失败！"
#string STR_SET_USER_ACCESS_CMD_PASS                #language zh-chs "设置用户访问命令成功！"
#string STR_USER_NAME_NOT_AVAILABLE                 #language zh-chs "用户名不可用！"
#string STR_USER_PASSWORD_INVALID_SIZE              #language zh-chs "用户密码大小无效！"
#string STR_USER_PASSWORD_MISMATCH                  #language zh-chs "用户密码不匹配！"
#string STR_USER_NAME_DELETE_FAIL                   #language zh-chs "删除用户名失败！"
#string STR_USER_DELETED                            #language zh-chs "用户删除！"
#string STR_USER_NAME_NOT_FOUND                     #language zh-chs "未找到用户名！"
#string STR_INVALID_USER_PASSWORD                   #language zh-chs "用户密码无效！"
#string STR_USER_ENABLE_OPERATION_FAIL              #language zh-chs "用户启用操作失败！"
#string STR_USER_DISABLE_OPERATION_FAIL             #language zh-chs "用户禁用操作失败！"
#string STR_USER_ENABLE_OPERATION_PASS              #language zh-chs "用户启用操作成功！"
#string STR_USER_DISABLE_OPERATION_PASS             #language zh-chs "用户禁用操作成功！"
#string STR_ADD_USERNAME_OPERATION_PASSED           #language zh-chs "添加用户成功！"
#string STR_VALID_BMC_LAN_CHANNEL_NOT_FOUND         #language zh-chs "无效BMC通道号"
#string STR_CHANGED_USERPASSWORD_OPERATION_PASSED   #language zh-chs "密码修改成功！"
#string STR_INVALID_INPUT                           #language zh-chs "无效输入！"

//
// BmcSelfTestLog.uni
//
#string STR_BMC_SELFTEST_LOG                        #language zh-chs "BMC自测日志"
#string STR_BMC_SELFTEST_LOG_HELP                   #language zh-chs "记录通过BMC自测命令返回的报告"
#string STR_BST_ERASE_LOG                           #language zh-chs "清除日志"
#string STR_BST_ERASE_LOG_HELP                      #language zh-chs "清除日志选项"
#string STR_BST_ERASE_LOG_FULL                      #language zh-chs "当日志为满时"
#string STR_BST_ERASE_LOG_FULL_YES                  #language zh-chs "清除日志"
#string STR_BST_ERASE_LOG_FULL_NO                   #language zh-chs "不再记录日志"
#string STR_BST_ERASE_LOG_YES                       #language zh-chs "是，在每次重启"
#string STR_BST_ERASE_LOG_NO                        #language zh-chs "否"
#string STR_BST_ERASE_LOG_FULL_HELP                 #language zh-chs "选择在日志满时使用的操作"
#string STR_BMCSELFTESTLOG_EMPTY                    #language zh-chs "空日志"

//
// DxeFrb.uni
//
#string STR_RESET                                   #language zh-chs "重启"
#string STR_POWERDOWN                               #language zh-chs "关机"
#string STR_DO_NOTHING                              #language zh-chs "不做任何事情"
#string STR_POWERCYCLE                              #language zh-chs "电源重启"
#string STR_TIME_3MIN                               #language zh-chs "3分钟"
#string STR_TIME_4MIN                               #language zh-chs "4分钟"
#string STR_TIME_5MIN                               #language zh-chs "5分钟"
#string STR_TIME_6MIN                               #language zh-chs "6分钟"
#string STR_TIME_10MIN                              #language zh-chs "10分钟"
#string STR_TIME_15MIN                              #language zh-chs "15分钟"
#string STR_TIME_20MIN                              #language zh-chs "20分钟"
#string STR_SRVRMGMT_FRB_2ENABLE                    #language zh-chs "FRB-2计时器"
#string STR_SRVRMGMT_FRB_2ENABLE_HELP               #language zh-chs "启用或禁用FRB-2计时器(POST计时器)"
#string STR_SRVRMGMT_FRB_TIMEOUT                    #language zh-chs "FRB-2计时器延时"
#string STR_SRVRMGMT_FRB_TIMEOUT_HELP               #language zh-chs "给FRB-2计时器截止时间设定1到30min之间的值"
#string STR_SRVRMGMT_FRB_TIMEOUT_POLICY             #language zh-chs "FRB-2计时器策略"
#string STR_SRVRMGMT_FRB_TIMEOUT_POLICY_HELP        #language zh-chs "配置当达到FRB-2计时器设定时间后系统应该做出的响应。当FRB-2计时器禁用后该设置不起作用。"
#string STR_OS_BOOT_WD_TIMER                        #language zh-chs "OS看门狗计时器"
#string STR_OS_BOOT_WD_TIMER_HELP                   #language zh-chs "如果启用，启动一个BIOS计时器,该时间仅能够在加载操作系统后由OS的管理软件关闭。操作系统看门狗计时器可以帮助决定操作系统成功加载还是遵循操作系统引导看门狗时间政策。"
#string STR_OS_BOOT_WD_TIMER_TIMEOUT                #language zh-chs "OS看门狗计时器延时"
#string STR_OS_BOOT_WD_TIMER_TIMEOUT_HELP           #language zh-chs "为操作系统看门狗定时器 Expiration输入1到30分钟之间的值。如果操作系统的看门狗计时器禁用了则不起作用。"
#string STR_OS_BOOT_WD_TIMER_TIMEOUT_POLICY         #language zh-chs "OS看门狗计时器策略"
#string STR_OS_BOOT_WD_TIMER_TIMEOUT_POLICY_HELP    #language zh-chs "配置当达到操作系统看门狗设置时间，系统将做出如何响应。如果操作系统看门狗计时器禁用了则不起作用。"

//
// SelSetup.uni
//
#string STR_ENABLING_DISABLING_OPTIONS              #language zh-chs "启用/禁用选项"
#string STR_SEL_EVENT_LOG_TITLE                     #language zh-chs "系统事件日志"
#string STR_SEL_EVENT_LOG_HELP                      #language zh-chs "按<Enter>修改SEL事件日志配置"
#string STR_SEL_ENABLE                              #language zh-chs "SEL元件"
#string STR_SEL_ENABLE_HELP                         #language zh-chs "修改它用来启用或者禁用事件日志记录在错误/进行引导代码的过程中"
#string STR_SEL_ERASE                               #language zh-chs "清除SEL"
#string STR_SEL_ERASE_HELP                          #language zh-chs "选择选项清除SEL"
#string STR_SEL_DO_NOT_ERASE                        #language zh-chs "否"
#string STR_SEL_ERASE_NEXT_BOOT                     #language zh-chs "是，在下一次重启生效"
#string STR_SEL_ERASE_EVERY_BOOT                    #language zh-chs "是，在每一次重启生效"
#string STR_SEL_FULL                                #language zh-chs "当SEL为满"
#string STR_SEL_FULL_HELP                           #language zh-chs "对于满的SEL选择选项"
#string STR_SEL_DO_NOTHING                          #language zh-chs "不做任何事情"
#string STR_SEL_ERASE_WHEN_FULL                     #language zh-chs "立即清除"
#string STR_SEL_DEL_WHEN_FULL                       #language zh-chs "删除最旧记录"
#string STR_ERROR_CODE                              #language zh-chs "错误码"
#string STR_PROGRESS_CODE                           #language zh-chs "进度码"
#string STR_SEL_EFI_SETTINGS                        #language zh-chs "自定义EFI日志选项"
#string STR_SEL_ERASING_OPTIONS                     #language zh-chs "清除设置"
#string STR_ERROR_LOGGING_NOTE_1                    #language zh-chs "提示：所有的值都会改变"
#string STR_ERROR_LOGGING_NOTE_2                    #language zh-chs "      作用于计算机的功能"
#string STR_LOG_EFI_ERRORS_PROMPT                   #language zh-chs "日志EFI状态码"                                           
#string STR_LOG_EFI_ERRORS_HELP                     #language zh-chs "禁用EFI状态码的日志记录或者只记录错误代码或只有进度代码或者两者都有"
#string CHECK_SEL_FULL                              #language zh-chs "SEL是满的"

//******************************************************************************
//******************************************************************************
//**                                                                          **
//** Copyright(C) 2020-2021, XCradle Electronic Information Industry Co., Ltd. **
//**                                                                          **
//**                          All Rights Reserved.                            **
//**                                                                          **
//******************************************************************************
//******************************************************************************